Repository: ljbalbach/Personal_Site
Catalog: lib/l10n/intl_*.arb
Languages: es

# language
source: Español
es: English

source: About
es: Sobre

# about_description
source: I am someone who likes to be curious – take a new course, learn a new sport, play a new instrument. For some reason it doesn’t stop there; it needs to be as weird as possible. If I have heard of something, or know someone else has it, I become uninterested. From the purple jackets I wear, to the songs I listen to, to the software I like to make; It all needs to be exciting, unique, and done the right way, otherwise why bother. I am an avid pianist, traveler, kiteboarder, SCUBA diver, backcountry alpine skier, mountain climber, and anything else I can get my hands on. I speak Spanish for the most part – mainly to find new food to try. I love new things, but still somehow love coming back to my routine, my home, my friends, and my family. I don’t believe that my intelligence or talent have been instrumental bringing me to where I am today. For me, it’s my curiosity that compels me to push forward. While I may have the ability to do the research and write a thorough paper on Stalinism, my curiosity implores me to do something a bit more captivating. No offence meant toward anyone who has spent their life on Stalinism, but personally, I would rather rake cut grass into three perfect piles. In recent time, software engineers are no longer scarce, but anyone can build a website. My need for an answer forces me to be more inventive and have more fun. Given the time, curiosity will create something far more interesting than raw skill (not that I’m completely lacking in that area). This page is the perfect example of my point. While yes, I could have made the same personal site that everyone does, I find that boring and uninteresting. Quite frankly, I don’t think I could even finish one – I would probably end up fading away into something a bit more exciting, like lunch.
es: Soy una persona que le gusta ser curiosa: hacer un curso nuevo, aprender un deporte nuevo, tocar un instrumento nuevo. Por alguna razón no se detiene ahí; necesita ser lo más extraño posible. Si he oído hablar de algo, o sé que otra persona lo tiene, dejo de interesarme. Desde las chaquetas moradas que llevo hasta las canciones que escucho, pasando por el software que me gusta hacer; Todo tiene que ser emocionante y hecho de la manera correcta. Soy un ávido pianista, viajero, practicante de kitesurf, buceador, esquiador alpino de travesía, alpinista y cualquier otra cosa que se me ponga por delante. Hablo español en su mayor parte - sobre todo para encontrar nueva comida para probar. Me encantan las cosas nuevas, pero me encanta volver a mi rutina, a mi casa, a mis amigos y a mi familia. No creo que mi inteligencia o mi talento hayan sido decisivos para llevarme a donde estoy hoy. Para mí, es mi curiosidad la que me impulsa a seguir adelante. Aunque pueda tener la capacidad de investigar y escribir un artículo exhaustivo sobre el estalinismo, mi curiosidad me implora hacer algo un poco más cautivador. No quiero ofender a nadie que haya dedicado su vida al estalinismo, pero personalmente prefiero rastrillar la hierba cortada en tres montones perfectos. En los últimos tiempos, ya no escasean los ingenieros de software, sino que cualquiera puede construir un sitio web. Mi necesidad de una respuesta me obliga a ser más inventivo y a divertirme más. Si me dan tiempo, la curiosidad creará algo mucho más interesante que la habilidad bruta (no es que carezca por completo de ella). Esta página es el ejemplo perfecto. Aunque sí, podría haber hecho la misma página personal que hace todo el mundo, me parece bastante aburrida. Creo que ni siquiera podría terminar una: probablemente acabaría desvaneciéndome en algo un poco más emocionante, como el almuerzo.

source: Experience
es: Experiencia

# experience_visa
source: Graduate Software Engineer | Sep 2023 - Present
es: Ingeniero diplomado de Software | sep 2023 - dic 2024

# experience_visa_desc
source: • Full stack agile development in Java, Flutter, Python, Svelte, and SQL • Designed, developed, and delivered major sections of VisaGO - the first direct-to-consumer facing Visa app with digital issuance and the first to achieve over 150,000 downloads within 90 days • Integrated with ChatGPT on multiple internal projects to speed up other teams’ workflows
es: • Desarrollo ágil full stack en Java, Flutter, Python, Svelte, y SQL • Diseñó, desarrolló e impartió importantes secciones de VisaGO - la primera aplicación Visa con emisión digital dirigida directamente al consumidor y la primera en lograr más de 150.000 descargas en 90 días • Integración con ChatGPT en múltiples proyectos internos para agilizar los flujos de trabajo de otros equipos

# experience_calspan
source: Software Engineering Intern | May 2022 - Aug 2022
es: Becario de Ingeniería de Software | may 2022 - ago 2022

# experience_calspan_desc
source: • Designed & delivered a GUI in C++ for running scripts in a flight simulator, including XML customization • Tested cockpit emulators and software integration on Learjets, Gulfstreams, and the X-62 fighter jet
es: • Diseño y entrega de una interfaz gráfica de usuario en C++ para ejecutar secuencias de comandos en un simulador de vuelo, incluida la personalización en XML • Probado emuladores de cabina e integración de software en Learjets, Gulfstreams y el caza X-62

# experience_coachmeplus
source: Junior Software Developer | Jun 2020 - May 2022
es: Desarrollador de software junior | jun 2020 - may 2022

# experience_coachmeplus_desc
source: • Worked closely with Senior Developers to develop front end modules in current production release • Shipped PHP, HTML, and CSS features, and tested web applications locally and through TestFlight
es: • Trabajó en estrecha colaboración con desarrolladores senior para desarrollar módulos frontales en la versión de producción actual • Envío de funciones PHP, HTML y CSS, y prueba de aplicaciones web localmente y a través de TestFlight

source: Projects
es: Proyectos

# project_1_title
source: The Kite Calculator
es: La Calculadora de Cometas

# project_1_description
source: The kite calculator is a passion project of mine. I am an avid kiteboarder, windsurfer, and sailor. Where kiteboarding and windsurfing differ from sailing, is that depending on the wind, sailors can raise or lower their sail, changing the amount of surface area so they are never overpowered. Kites and windsurfers come in one size that cannot be changed, so you will need to buy another of a different size to sail in different weather. Given the unexpected nature of weather, in order to kite or windsurf anywhere regularly, you will need at least 2 or three sizes. This uncertainty is where this site comes into use. Given the rider’s weight and the current wind speed, it can give you a recommended kite size in m2. In the future, I would like to expand this to include windsurfing, kite foiling, and wing foiling, but for now, enjoy the water!
es: La calculadora de cometas es un proyecto que me apasiona. Soy un ávido practicante de kitesurf, windsurf y vela. En lo que se diferencian el kitesurf y el windsurf de la vela es en que, dependiendo del viento, los navegantes pueden subir o bajar la vela, cambiando la cantidad de superficie para que nunca se vean desbordados. Las cometas y los windsurf vienen en un tamaño que no se puede cambiar, por lo que tendrás que comprar otro de diferente tamaño para navegar con otro tiempo. Dada la naturaleza inesperada del tiempo, para poder hacer kitesurf o windsurf en cualquier lugar con regularidad, necesitarás al menos dos o tres tallas. En esta incertidumbre es donde entra en juego esta web. Teniendo en cuenta el peso del rider y la velocidad actual del viento, puede darte una talla de cometa recomendada en m2. En el futuro, me gustaría ampliarlo para incluir el windsurf, el kite foiling y el wing foiling, pero por ahora, ¡disfruta del agua!

# project_2_title
source: Virtual Dive Simulator
es: Simulador Virtual de Buceo

# project_2_description
source: Virtual reality provides an escape from everyday life. It allows users to experience an artificial environment that they may otherwise never see. VR is not just used for entertainment; it has very real practical and educational applications. This project seeks to use virtual reality to teach users some of the basics of scuba diving. By reducing the barrier to entry, it will make diving more accessible, and hopefully spread interest in it. The final artifact is a scuba diving simulator that will show how applicable VR is as a teaching method. This scuba diving simulator uses aspects from real diving courses to make it more realistic. It uses virtual gauges based off real dive instruments and encourages the users to learn their functionality through trial and error. Teaching a subject through virtual reality makes it more like a game. This change of point of view can help users engage with the teaching and absorb more information. Participants in the simulator’s user study agreed that this simulator would encourage environmental awareness despite not having a large focus on the topic. By getting more people interested in diving, the simulator could help to spread involvement in ocean conservation. Most participants were able to learn more about the subject and found the experience immersive and informative. The project provides a great basis for expansion into other aspects of diving or even different subjects. It could also be integrated with various dive courses to help improve and streamline the learning process.
es: La realidad virtual permite escapar de la vida cotidiana. Permite a los usuarios experimentar un entorno artificial que de otro modo nunca verían. La realidad virtual no sólo se utiliza para el entretenimiento, sino que tiene aplicaciones prácticas y educativas muy reales. Este proyecto pretende utilizar la realidad virtual para enseñar a los usuarios algunos de los fundamentos del submarinismo. Al reducir la barrera de entrada, hará que el buceo sea más accesible y, con un poco de suerte, difundirá el interés por él. El artefacto final es un simulador de submarinismo que demostrará lo aplicable que es la RV como método de enseñanza. Este simulador de submarinismo utiliza aspectos de cursos de buceo reales para hacerlo más realista. Utiliza manómetros virtuales basados en instrumentos de buceo reales y anima a los usuarios a aprender su funcionalidad mediante ensayo y error. Enseñar una materia a través de la realidad virtual hace que se parezca más a un juego. Este cambio de punto de vista puede ayudar a los usuarios a comprometerse con la enseñanza y absorber más información. Los participantes en el estudio de usuarios del simulador coincidieron en que éste fomentaría la concienciación medioambiental a pesar de no centrarse demasiado en el tema. Al conseguir que más gente se interese por el buceo, el simulador podría contribuir a difundir la implicación en la conservación de los océanos. La mayoría de los participantes pudieron aprender más sobre el tema y encontraron la experiencia inmersiva e informativa. El proyecto es una buena base para ampliarlo a otros aspectos del buceo o incluso a otros temas. También podría integrarse en diversos cursos de buceo para ayudar a mejorar y agilizar el proceso de aprendizaje.

source: Photos
es: Fotos
